namespace :evateks do
  desc "Tasks for evateks"

  	task colors: :environment do
		puts 'начали'

		evateks = Evatek.all

		col = []
		evateks.each do |ev|
			col.push(ev.cvet.strip)
		end
		colors = col.uniq
		puts colors.join(',').gsub('(',',').gsub(')','').gsub(',','","')

		puts 'закончили'
	end

	task uniq_colors: :environment do
	a = ["морская волна","коралл","шампань","ментол","хаки","кремовый","бежевый","ослепительно-белый","тёмно-бежевый","сирень","синий","оливковый","серый меланж","бирюзовый","сухая роза","нежно-кремовый","белый","нежно-бежевый","нежно-голубой","нежно-лиловый","лимонный","фиолетовый","нежно-розовый","бордо","персиковый","нежно-ментоловый","шоколад","разноцветный","серо-сиреневый","графит","какао","капучино","тёмно-синий","комбинированный","голубой","бирюза","голубой ","дымчатый оттенок","чернильный ","фиолетово-синий","розовый","серый","слива","мята","небо ","светло-бежевый","лазурный","фиалка","крем","серебро","фламинго","арктик","лила","фисташка","персик","голубые тона","лиловые тона","пудра","темная вишня","коричневый","светло-сиреневый","тёмно-сливовый","Розовый","дымчато-синий","василёк","ярко-синий","изумруд","баклажан","черный","нежно-сиреневый","нежно-серый с голубым","серебристо-серый","лиловый","изумрудный"," чайная роза","дельфин","приглушенный голубой","красный","мятный","оригинальный","коралл/гранатовый"," белый","бордовый","кремовый с рисунком","молочный","шоколадный","лайм","терракот","черный комбинированный","черный с золотистым","бургундия","грин","салатовый","сиреневый","брусника","желтый","антрацит","темно-серый","нежно-серый","индиго","светло-синий","ментоловый с шоколадным","зеленые тона","леопард","синие тона","Алый","Красный","темно-синий","розовые тона на сером","насыщенно-красный","Нежно-розовый","розовый с серым","незабудки","белый с бирюзовым","синий с серым","яркие бабочки","синие горошки","индийские мотивы","синие и сиреневые цветы","красные цветы","букет","зеленый тона","ярко-розовый","кремовый комбинированный","серебристый","ультрамарин","малиновый","нежно-белый","нежно-кремовый с цветами","бордовый","синий","чайная роза","слоновая кость","черный/серый","белый с розовыми цветами","фуксия","нежно-белый с розовыми цветами","комбинированный розовый","белый с синим","Синий","крем","темно-сиреневый","розовый","синий с черным","мокко","темно-синий/крем","марсала","темно-синий/бирюза","фиолетовый/лавандовый","фисташковый","нежно-персиковый","темный-изумрудный","латте","оливка","крем/серый","синий меланж","клетка","сливовый","тёмно-серый комбинированный","джинс","темный хаки","малахит","серо-лиловый","темно-бежевый","бордо меланж","голубой меланж","азалия","темно-розовый","кремовый меланж","коралловый","сине-серый","Бордо","роза","лимон","светлая пудра","дымчатый синий","табачный","меланж синий","светло-серый","меланж серый","чёрный","темно-шоколадный","крем","синий с голубым","насыщенно-серый","изысканный кремовый","тёмно-серый","индиго","синий комбинированный","серый комбинированный","табак","петрол","винныйтемно-серый","серая и черная клетка","серая клетка","синяя с бежевым клетка","комбинированный серый","комбинированный синий","синяя клетка","темный шоколад","капучино ","сливовый комбинированный","бордо","темно-бордовый","насыщенный синий","темно-красный/комбинированный","синий/комбинированный","комбинированный бордовый","синий меланж/комбинированный","темно-сливовый/комбинированный","голубая клетка","бордовая и синяя клетка","бежевая и голубая клетка","синяя и красная клетка","черная клетка","бордовая клетка","мелкая клетка","джинс меланж","светло-голубой меланж","серый и антрацит","терракот и черный","насыщенный серый","голубой и серый","тёмно-шоколадный","Sea wave морская волна","темно-салатовый","темно-голубой","Белый","парламент","темно-бирюзовый","чернильный-синий","серо-голубой","оливковый-хаки","светло-кофейный","темно-кофейный","темно-зеленый","васильковый","красный"," оранжевый","бежевый","в ассортименте","шоколадные тона","красная полоска","розовый неон","синяя абстракция","сиреневый с красными розами","золотистый","розовый с бабочками","светлый хаки","бабочки на желтом фоне","бирюзовые цветы","Нежно-серый с розовым","сиреневый комбинированный"]
	b = a.uniq
	puts b.join(',').gsub(',','","')
	end

  	task sizes: :environment do
	puts 'начали'

	evateks = Evatek.all.order(:id)

	siz = []
	evateks.each do |ev|
		siz.push(ev.razmer_eu.strip)
		siz.push(ev.razmer_ru.strip)
	end
	sizes = siz.uniq
	puts sizes.join(',').gsub('(',',').gsub(')','').gsub(',','","')

	puts 'закончили'
	end

	task uniq_sizes: :environment do
	a = []
	b = a.uniq
	puts b.join(',').gsub(',','","')
	end

	task import_old_base: :environment do
    file = "#{Rails.public_path}"+"/evatek_full.csv"
  	spreadsheet = Roo::CSV.new(file)
  	header = spreadsheet.row(1)

  	  (2..spreadsheet.last_row).each do |i|

  	  		row = Hash[[header, spreadsheet.row(i)].transpose]
  	  		data = {
                  eid: row["eid"],
                  url: row["url"],
                  title: row["title"],
                  sku: row["sku"],
                  cprice: row["cprice"],
                  sdesc: row["sdesc"],
                  desc: row["desc"],
                  price: row["price"],
                  oprice: row["oprice"],
                  qt: row["qt"],
                  razmer_eu: row["razmer_eu"],
                  razmer_ru: row["razmer_ru"],
                  uzor: row["uzor"],
                  cvet: row["cvet"],
                  sostav: row["sostav"],
                  weight: row["weight"],
                  vendor: row["vendor"],
                  col: row["col"],
                  country: row["country"],
                  image: row["image"]
          	  		}

  			  Evatek.create_update_by_eid(data)
  		end
	end

end
